chentianveiko/yan_motion_detection_module-rf_config_with_old_pro/stm8_iar_project/RF_bootloader/Source/bootloader/hal_rf.c
/*
 *******************************************************************************
 *                                  INCLUDE                                  
 *******************************************************************************
 */
#include "hal_rf.h"
#include "virtual_spi.h"
#include "stm8l15x.h"
#include <string.h>

/*
 *******************************************************************************
 *                                 CONSTANTS                                     
 *******************************************************************************
 */
#define A7139_1_SPI_CS_GPIO         GPIOB
#define A7139_1_SPI_CS_PIN          GPIO_Pin_4
#define A7139_1_WTR_GPIO            GPIOB
#define A7139_1_WTR_PIN             GPIO_Pin_3
#define A7139_1_EXTI_PIN            EXTI_Pin_3
#define A7139_1_EXTI_IT_PIN         EXTI_IT_Pin3
#define HAL_RF1_INTERRUPT_HANDLER() INTERRUPT_HANDLER(EXTI3_IRQHandler, 11)

/* A7139_ Defines */
#define SYSTEMCLOCK_REG 	0x00
#define PLL1_REG 		0x01
#define PLL2_REG 		0x02
#define PLL3_REG 		0x03
#define PLL4_REG		0x04
#define PLL5_REG		0x05
#define PLL6_REG		0x06
#define CRYSTAL_REG		0x07
#define PAGEA_REG	  	0x08
#define PAGEB_REG		0x09
#define RX1_REG  		0x0A
#define RX2_REG  		0x0B
#define ADC_REG  		0x0C
#define PIN_REG 		0x0D
#define CALIBRATION_REG  	0x0E
#define MODE_REG  		0x0F

#define TX1_PAGEA               0x00
#define WOR1_PAGEA              0x01
#define WOR2_PAGEA              0x02
#define RFI_PAGEA               0x03
#define PM_PAGEA                0x04
#define RTH_PAGEA               0x05
#define AGC1_PAGEA              0x06
#define AGC2_PAGEA              0x07
#define GIO_PAGEA               0x08
#define CKO_PAGEA               0x09
#define VCB_PAGEA               0x0A
#define CHG1_PAGEA              0x0B
#define CHG2_PAGEA              0x0C
#define FIFO_PAGEA	       	0x0D
#define CODE_PAGEA		0x0E
#define WCAL_PAGEA		0x0F

#define TX2_PAGEB		0x00
#define	IF1_PAGEB		0x01
#define IF2_PAGEB		0x02
#define	ACK_PAGEB		0x03
#define	ART_PAGEB		0x04


#define CMD_Reg_W		0x00	//000x,xxxx	control register write
#define CMD_Reg_R		0x80	//100x,xxxx	control register read
#define CMD_ID_W		0x20	//001x,xxxx	ID write
#define CMD_ID_R		0xA0	//101x,xxxx	ID Read
#define CMD_FIFO_W		0x40	//010x,xxxx	TX FIFO Write
#define CMD_FIFO_R		0xC0	//110x,xxxx	RX FIFO Read
#define CMD_RF_RST		0x70	//x111,xxxx	RF reset
#define CMD_TFR			0x60	//0110,xxxx	TX FIFO address pointrt reset
#define CMD_RFR			0xE0	//1110,xxxx	RX FIFO address pointer reset

#define CMD_SLEEP		0x10	//0001,0000	SLEEP mode
#define CMD_IDLE		0x12	//0001,0010	IDLE mode
#define CMD_STBY		0x14	//0001,0100	Standby mode
#define CMD_PLL			0x16	//0001,0110	PLL mode
#define CMD_RX			0x18	//0001,1000	RX mode
#define CMD_TX			0x1A	//0001,1010	TX mode
//#define CMD_DEEP_SLEEP	0x1C	//0001,1100 Deep Sleep mode(tri-state)
#define CMD_DEEP_SLEEP		0x1F	//0001,1111 Deep Sleep mode(pull-high)

/* 定义FIFO大小 */
#define FIFO_R       0x003F

#if (HAL_RF_DATE_RATE == HAL_RF_DATE_RATE_0_5KBPS)
/* A7139 433.201M DR0.5kbps IFBW50kHz Fdev18.75kHz@12.8M -123dBm */
const uint16_t A7139Config[]=		
{
  0xC623, /* SYSTEM CLOCK register,   */
  0x0A21, /* PLL1 register,           */
  0xDA05, /* PLL2 register,	      */
  0x0000, /* PLL3 register,           */
  0x0A20, /* PLL4 register,           */
  0x0024, /* PLL5 register,           */
  0x0000, /* PLL6 register,           */
  0x0011, /* CRYSTAL register,        */
  0x0000, /* PAGEA,                   */
  0x0000, /* PAGEB,                   */
  0x18D0, /* RX1 register, 	      */
  0x7009, /* RX2 register, 	      */
  0x4000, /* ADC register,	      */
  0x0800, /* PIN CONTROL register,    */
  0x4C45, /* CALIBRATION register,    */
  0x20C0, /* MODE CONTROL register,   */
};

const uint16_t A7139Config_PageA[]=   
{  
  0xF606, /* TX1 register,  */ 	
  0x0000, /* WOR1 register, */
  0xF800, /* WOR2 register, */
  0x1107, /* RFI register,  */	
  0x8970, /* PM register,   */	
  0x0201, /* RTH register,  */
  0x400F, /* AGC1 register, */	
  0x2AC0, /* AGC2 register, */ 
  0x0041, /* GIO register,  */	
  0xD181, /* CKO register   */
  0x0004, /* VCB register,  */
  0x0A21, /* CHG1 register, */ 	
  0x0022, /* CHG2 register, */ 	
  FIFO_R, /* FIFO register, */ 	
  0x1517, /* CODE register, */ 	
  0x0000, /* WCAL register, */
};

const uint16_t A7139Config_PageB[]=   
{
  0x0337, /* TX2 register */
  0x8200, /* IF1 register */ 	
  0x0000, /* IF2 register */
  0x0000, /* ACK register */
  0x0000, /* ART register */
};
#endif

#if (HAL_RF_DATE_RATE == HAL_RF_DATE_RATE_1_5KBPS)
/* 433M 1.5Kbps Fdev=18.75kHz IFBW=48KHz Xtal12.8MHz */
const uint16_t A7139Config[]=		
{
  0x3EC7, /* SYSTEM CLOCK register,   */
  0x0A21, /* PLL1 register,           */
  0xDA05, /* PLL2 register,	      */
  0x0000, /* PLL3 register,           */
  0x0A20, /* PLL4 register,           */
  0x0024, /* PLL5 register,           */
  0x0000, /* PLL6 register,           */
  0x0003, /* CRYSTAL register,        */
  0x0000, /* PAGEA,                   */
  0x0000, /* PAGEB,                   */
  0x18D0, /* RX1 register, 	      */
  0x7009, /* RX2 register, 	      */
  0x4400, /* ADC register,	      */
  0x0800, /* PIN CONTROL register,    */
  0x4C45, /* CALIBRATION register,    */
  0x20C0, /* MODE CONTROL register,   */
};

const uint16_t A7139Config_PageA[]=   
{
  0xF606, /* TX1 register,  */ 	
  0x0000, /* WOR1 register, */
  0xF800, /* WOR2 register, */
  0x1107, /* RFI register,  */	
  0x0170, /* PM register,   */	
  0x0201, /* RTH register,  */
  0x400F, /* AGC1 register, */	
  0x2AC0, /* AGC2 register, */ 
  0xC041, /* GIO register,  */	
  0xD283, /* CKO register   */
  0x0004, /* VCB register,  */
  0x0A21, /* CHG1 register, */ 	
  0x0022, /* CHG2 register, */ 	
  FIFO_R, /* FIFO register, */ 	
  0x1517, /* CODE register, */ 	
  0x0000, /* WCAL register, */
};

const uint16_t A7139Config_PageB[]=   
{
  0x837F, /* TX2 register */
  0x81EC, /* IF1 register */ 	
  0x0000, /* IF2 register */
  0x0000, /* ACK register */
  0x0000, /* ART register */
};
#endif

#if (HAL_RF_DATE_RATE == HAL_RF_DATE_RATE_10KBPS)
/* 433MHz, 10kbps (IFBW = 100KHz, Fdev = 37.5KHz), Crystal=12.8MHz */
const uint16_t A7139Config[]=		
{
  0x1221, /* SYSTEM CLOCK register,   */
  0x0A21, /* PLL1 register,           */
  0xDA05, /* PLL2 register,	      */
  0x0000, /* PLL3 register,           */
  0x0A20, /* PLL4 register,           */
  0x0024, /* PLL5 register,           */
  0x0000, /* PLL6 register,           */
  0x0011, /* CRYSTAL register,        */
  0x0000, /* PAGEA,                   */
  0x0000, /* PAGEB,                   */
  0x18D4, /* RX1 register, 	      */    
  0x7009, /* RX2 register, 	      */
  0x4000, /* ADC register,	      */ 
  0x0800, /* PIN CONTROL register,    */  
  0x4C45, /* CALIBRATION register,    */
  0x20C0, /* MODE CONTROL register,   */
};                                      

const uint16_t A7139Config_PageA[]=   
{
  0xF706, /* TX1 register,   */	
  0x0000, /* WOR1 register,  */
  0xF800, /* WOR2 register,  */
  0x1107, /* RFI register,   */
  0x8170, /* PM register,    */
  0x0201, /* RTH register,   */
  0x400F, /* AGC1 register,  */
  0x2AC0, /* AGC2 register,  */
  0x0045, /* GIO register,   */
  0xD181, /* CKO register    */
  0x0004, /* VCB register,   */
  0x0A21, /* CHG1 register,  */	
  0x0022, /* CHG2 register,  */	
  FIFO_R, /* FIFO register,  */	
  0x1517, /* CODE register,  */	
  0x0000, /* WCAL register,  */
};

const uint16_t A7139Config_PageB[]=   
{
  0x037F, /* TX2 register, */
  0x8400, /* IF1 register, */	
  0x0000, /* IF2 register, */
  0x0000, /* ACK register, */
  0x0000, /* ART register, */
};
#endif

const uint16_t A7139ChannelValues[HAL_RF_CHANNEL_NB] = 
{
  0xDA05, /* 433MHz */
  0xB205, /* 431MHz */
  0x8A05, /* 429MHz */
  0x6205, /* 427MHz */
  0x3A05, /* 425MHz */
  0x1205, /* 423MHz */
};

