chentianveiko/yan_motion_detection_module-rf_config_with_old_pro/stm8_iar_project/RF_bootloader/Source/bootloader/hal_rf.c
/*
 *******************************************************************************
 *                                  TYPEDEFS                                  
 *******************************************************************************
 */
enum DeviceState 
{
  Init,
  Standby,
  Sending,
  SendDone,
  Receiving,
  ReceiveDone,
};

/*
 *******************************************************************************
 *                                  MACROS                                  
 *******************************************************************************
 */
#define HAL_RF_ID_TO_OBJECT(id)  ((struct A7139_Device *)(((id) >= HalRFDeviceNum) ? NULL : &A7139_DeviceList[(id)]))

/*
 *******************************************************************************
 *                                  TYPEDEFS                                  
 *******************************************************************************
 */
struct A7139_Device
{
  enum HalRFDevice device;
  struct virtual_spi_device *spi_device;
  enum DeviceState state;
  int rssi;
  uint8_t rx_buff[64];
};

/*
 *******************************************************************************
 *                              LOCAL FUNCTIONS                                  
 *******************************************************************************
 */
#if (defined HAL_RF_1)
static void A7139_1_SpiSelect(uint8_t set);
#endif

#if (defined HAL_RF_2)
static void A7139_2_SpiSelect(uint8_t set);
#endif

static void A7139_SpiDelay(void);
static void GPIO_Configration(void);

static void A7139_Delay(uint32_t ms);

static void A7139_WriteCommand(struct A7139_Device *device, uint8_t cmd);
static void A7139_WriteID(struct A7139_Device *device, uint32_t id);
static void A7139_WriteRegister(struct A7139_Device *device, uint8_t address, uint16_t data);
static uint16_t A7139_ReadRegister(struct A7139_Device *device, uint8_t address);
static void A7139_WritePageA(struct A7139_Device *device, uint8_t address, uint16_t dataWord);
static uint16_t A7139_ReadPageA(struct A7139_Device *device, uint8_t address);
static void A7139_WritePageB(struct A7139_Device *device, uint8_t address, uint16_t dataWord);
static uint16_t A7139_ReadPageB(struct A7139_Device *device, uint8_t address);
static void A7139_Config(struct A7139_Device *device);
static void A7139_Calibration(struct A7139_Device *device);
static void _A7139_Calibration(struct A7139_Device *device, uint16_t pll2);
static void A7139_WriteFIFO(struct A7139_Device *device, uint8_t *data, uint8_t length);
static uint8_t A7139_ReadFIFO(struct A7139_Device *device, uint8_t *data, uint8_t size);        
static void A7139_StartRSSIMeasurement(struct A7139_Device *device);

/*
 *******************************************************************************
 *                              LOCAL VARIABLES                                 
 *******************************************************************************
 */
#if (defined HAL_RF_1)
struct virtual_spi_device A7139_SPIDevice1 = 
{
  .bus    = &spi_bus_1,
  .cs_set = A7139_1_SpiSelect,
  .delay  = A7139_SpiDelay,
};
#endif

#if (defined HAL_RF_2)
struct virtual_spi_device A7139_SPIDevice2 = 
{
  .bus    = &spi_bus_1,
  .cs_set = A7139_2_SpiSelect,
  .delay  = A7139_SpiDelay,
};
#endif

struct A7139_Device A7139_DeviceList[] = 
{
#if (defined HAL_RF_1)
  {.device = HalRF1, .spi_device = &A7139_SPIDevice1, .state = Init, },
#endif
  
#if (defined HAL_RF_2)
  {.device = HalRF1, .spi_device = &A7139_SPIDevice2, .state = Init, },
#endif
};

/*
 *******************************************************************************
 *                                 FUNCTIONS                                 
 *******************************************************************************
 */
void HalRFInit(void)
{
  struct A7139_Device *device;
  int i;
  uint32_t id = 0x11223344;
  
  
  GPIO_Configration();
  
  for (i = 0; i < HalRFDeviceNum; i++)
  {
    device = &A7139_DeviceList[i];
    
    if (NULL == device) continue;
    
    device->state = Init;

    A7139_WriteCommand(device, CMD_RF_RST);
    A7139_Delay(1);
    A7139_Config(device);
    A7139_Delay(1);
    A7139_WriteID(device, id);
//    A7139_Calibration(device);     
    A7139_Delay(1);
  }
}

void HalRFSend(enum HalRFDevice rf, unsigned char *data, unsigned char length)
{
  struct A7139_Device *device;
  
  
  device = HAL_RF_ID_TO_OBJECT(rf);
  
  if (NULL == device) return;
  
  device->state = Standby;
  A7139_WriteCommand(device, CMD_STBY); 
  
  device->state = Sending;
  A7139_WriteFIFO(device, data, length);
  A7139_WriteCommand(device, CMD_TX);
}

unsigned char HalRFReceive(enum HalRFDevice rf, unsigned char *data, unsigned char size)
{
  struct A7139_Device *device;
  unsigned char length;
  
  
  device = HAL_RF_ID_TO_OBJECT(rf);
  
  if (NULL == device) return 0;
  
  length = sizeof(device->rx_buff) > size ? size : sizeof(device->rx_buff);
  
  memcpy(data, device->rx_buff, length);

    
  return length;
}

int HalRFReadRSSI(enum HalRFDevice rf)
{
  struct A7139_Device *device;
  int value;
  
  
  device = HAL_RF_ID_TO_OBJECT(rf);
  
  value = device->rssi;
  
  return value;
}

bool HalRFSetChannel(enum HalRFDevice rf, HalRFChannel_t ch)
{
  struct A7139_Device *device;
  bool result = FALSE;
  int  index;
  
  device = HAL_RF_ID_TO_OBJECT(rf);
  
  if ( (device != NULL) && (ch < HAL_RF_CHANNEL_NB) )
  {
    index = ch;   
    A7139_WriteCommand(device, CMD_STBY); 
    A7139_WriteRegister(device, PLL2_REG, A7139ChannelValues[index]);
    _A7139_Calibration(device, A7139ChannelValues[index]);
//    A7139_StartRSSIMeasurement(device);
//    device->state = Receiving;
//    A7139_WriteCommand(device, CMD_RX);
    result = TRUE;
  }
  
  return result;
}

/*
 *******************************************************************************
 *                              LOCAL FUNCTIONS                                  
 *******************************************************************************
 */
#if (defined HAL_RF_1)
static void A7139_1_SpiSelect(uint8_t set)
{  
  GPIO_WriteBit(A7139_1_SPI_CS_GPIO, A7139_1_SPI_CS_PIN, (BitAction)set);
}
#endif

#if (defined HAL_RF_2)
static void A7139_2_SpiSelect(uint8_t set)
{  
  GPIO_WriteBit(A7139_2_SPI_CS_GPIO, A7139_2_SPI_CS_PIN, (BitAction)set);
}
#endif

static void A7139_SpiDelay(void)
{
  ;
}

static void GPIO_Configration(void)
{
  /* A7139 Device1 CS Pin */
  GPIO_Init(A7139_1_SPI_CS_GPIO, A7139_1_SPI_CS_PIN, GPIO_Mode_Out_PP_High_Fast);
  GPIO_WriteBit(A7139_1_SPI_CS_GPIO, A7139_1_SPI_CS_PIN, SET);

  /* A7139 Device1 GIO1 Pin */
  GPIO_Init(A7139_1_WTR_GPIO, A7139_1_WTR_PIN, GPIO_Mode_In_PU_IT);
  EXTI_SetPinSensitivity(A7139_1_EXTI_PIN, EXTI_Trigger_Falling);  
}

static void A7139_Delay(uint32_t ms)
{
  uint32_t i = 0;
  
  /* Enable TIM2 Clock */
  CLK_PeripheralClockConfig(CLK_Peripheral_TIM2, ENABLE);
  
