chentianveiko/yan_motion_detection_module-rf_config_with_old_pro/stm8_iar_project/RF_bootloader/Source/bootloader/hal_rf.c
  /* Configure TIM2 to generate an update event each 1 s */
  TIM2_TimeBaseInit(TIM2_Prescaler_128, TIM2_CounterMode_Up, 125);
  
  /* Enable TIM2 */
  TIM2_Cmd(ENABLE);
  
  /* Clear the Flag */
  TIM2_ClearFlag(TIM2_FLAG_Update);
  TIM2_ARRPreloadConfig(ENABLE);
  
  for (i = 0; i < ms; i++)
  {
    /* Wait 1 ms */
    while ( TIM2_GetFlagStatus(TIM2_FLAG_Update) == RESET )
    {}
    
    /* Clear the Flag */
    TIM2_ClearFlag(TIM2_FLAG_Update);
  }
  
  /* Disable TIM2 */
  TIM2_Cmd(DISABLE);
  
  /* Disable TIM2 Clock */
  CLK_PeripheralClockConfig(CLK_Peripheral_TIM2, DISABLE);
}

/*
 *******************************************************************************
  @brief    向A7139写入命令
 
  @params   device - A7139设备对象
            cmd - 写入的命令
 
  @return   无
 *******************************************************************************
 */
static void A7139_WriteCommand(struct A7139_Device *device, uint8_t cmd)
{
  struct virtual_spi_device *spi_device;
  
  
  if (device != NULL)
  {
    spi_device = device->spi_device;
    
    spi_device_select(spi_device);
    spi_send_recv(spi_device, cmd);
    spi_device_deselect(spi_device);
  }
}

/*
 *******************************************************************************
  @brief    向A7139写入ID
 
  @params   device - A7139设备对象
            id - 写入的id
 
  @return   无
 *******************************************************************************
 */
static void A7139_WriteID(struct A7139_Device *device, uint32_t id)
{
  volatile uint8_t read_id[4] = {0};
  int i;
  struct virtual_spi_device *spi_device;
  
  
  if (device != NULL)
  {
    spi_device = device->spi_device;
    
    /* 写入ID */
    spi_device_select(spi_device);
    
    spi_send_recv(spi_device, CMD_ID_W);
    
    spi_send_recv(spi_device, (uint8_t)(id >> 24));
    spi_send_recv(spi_device, (uint8_t)(id >> 16));
    spi_send_recv(spi_device, (uint8_t)(id >> 8));
    spi_send_recv(spi_device, (uint8_t)(id >> 0));
    
    spi_device_deselect(spi_device);
    
    
    /* 读取ID验证通信是否正常 */
    spi_device_select(spi_device);
    
    spi_send_recv(spi_device, CMD_ID_R);
    
    for (i = 0; i < 4; i++)
      read_id[i] = spi_send_recv(spi_device, 0);
    
    spi_device_deselect(spi_device);
  }
}

/*
 *******************************************************************************
  @brief    向A7139寄存器写入数据
 
  @params   device - A7139设备对象
            address - 寄存器地址
            data    - 写入豁口的数据
 
  @return   无
 *******************************************************************************
 */
static void A7139_WriteRegister(struct A7139_Device *device, uint8_t address, uint16_t data)
{
  struct virtual_spi_device *spi_device;
  
  
  if (device != NULL)
  {
    spi_device = device->spi_device;
    
    spi_device_select(spi_device);
    
    spi_send_recv(spi_device, (address | CMD_Reg_W));   
    spi_send_recv_16(spi_device, data);
    
    spi_device_deselect(spi_device);    
  }
}

/*
 *******************************************************************************
  @brief    从A7139寄存器读出数据
 
  @params   device - A7139设备对象
            address - 寄存器地址
 
  @return   无
 *******************************************************************************
 */
static uint16_t A7139_ReadRegister(struct A7139_Device *device, uint8_t address)
{
  struct virtual_spi_device *spi_device;
  uint16_t read_data = 0;
  
  
  if (device != NULL)
  {
    spi_device = device->spi_device;
    
    spi_device_select(spi_device);
    
    spi_send_recv(spi_device, (address | CMD_Reg_R));   
    read_data = spi_send_recv_16(spi_device, 0);
    
    spi_device_deselect(spi_device);    
  }
  
  return read_data;
}

/*
 *******************************************************************************
  @brief    A7139写PAGEA
 
  @params   device - A7139设备对象
            address - 
            dataWord -
 
  @return   无
 *******************************************************************************
 */
static void A7139_WritePageA(struct A7139_Device *device, uint8_t address, uint16_t dataWord)
{
  uint16_t tmp;
  
  
  tmp = address;
  tmp = ((tmp << 12) | A7139Config[CRYSTAL_REG]);
  
  A7139_WriteRegister(device, CRYSTAL_REG, tmp);
  A7139_WriteRegister(device, PAGEA_REG, dataWord);
}

static uint16_t A7139_ReadPageA(struct A7139_Device *device, uint8_t address)
{
  uint16_t tmp;
  
  
  tmp = address;
  tmp = ((tmp << 12) | A7139Config[CRYSTAL_REG]);
  A7139_WriteRegister(device, CRYSTAL_REG, tmp);
  tmp = A7139_ReadRegister(device, PAGEA_REG);
  
  return tmp;
}

/*
 *******************************************************************************
  @brief    A7139写PAGEB
 
  @params   device - A7139设备对象
            address - 
            dataWord -
 
  @return   无
 *******************************************************************************
 */
static void A7139_WritePageB(struct A7139_Device *device, uint8_t address, uint16_t dataWord)
{
  uint16_t tmp;
  
  
  tmp = address;
  tmp = ((tmp << 7) | A7139Config[CRYSTAL_REG]);
  
  A7139_WriteRegister(device, CRYSTAL_REG, tmp);
  A7139_WriteRegister(device, PAGEB_REG, dataWord);
}

static uint16_t A7139_ReadPageB(struct A7139_Device *device, uint8_t address)
{
  uint16_t tmp;
  
  
  tmp = address;
  tmp = ((tmp << 7) | A7139Config[CRYSTAL_REG]);
  A7139_WriteRegister(device, CRYSTAL_REG, tmp);
  tmp = A7139_ReadRegister(device, PAGEB_REG);
  
  return tmp;
}

/*
 *******************************************************************************
  @brief    向A7139写入配置序列表
 
  @params   device - A7139设备对象
 
  @return   无
 *******************************************************************************
 */
static void A7139_Config(struct A7139_Device *device)
{
  uint8_t i;
  
  
  for(i = 0; i < 8; i++)
    A7139_WriteRegister(device, i, A7139Config[i]);
  
  for(i = 10; i < 16; i++)
    A7139_WriteRegister(device, i, A7139Config[i]);
  
  for(i = 0; i < 16; i++)
    A7139_WritePageA(device, i, A7139Config_PageA[i]);
  
  for(i = 0; i < 5; i++)
    A7139_WritePageB(device, i, A7139Config_PageB[i]);
}

