chentianveiko/yan_motion_detection_module-rf_config_with_old_pro/stm8_iar_project/RF_bootloader/Source/bootloader/hal_rf.c
/*
 *******************************************************************************
  @brief    IF and VCO calibration
 
  @params   device - A7139设备对象
 
  @return   无
 *******************************************************************************
 */
static void A7139_Calibration(struct A7139_Device *device)
{
  volatile uint8_t fb, fcd, fbcf;	//IF Filter
  volatile uint8_t vb,vbcf;              //VCO Current
  volatile uint8_t vcb, vccf;		//VCO Band
  uint16_t tmp;
  
  //IF calibration procedure @STB state
  A7139_WriteRegister(device, MODE_REG, A7139Config[MODE_REG] | 0x0802);			//IF Filter & VCO Current Calibration
  do
  {
    tmp = A7139_ReadRegister(device, MODE_REG);
  }while(tmp & 0x0802);
  
  //for check(IF Filter)
  tmp = A7139_ReadRegister(device, CALIBRATION_REG);
  fb = tmp & 0x0F;
  fcd = (tmp>>11) & 0x1F;
  fbcf = (tmp>>4) & 0x01;
  if (fbcf)
  {
    
  }
  
  //for check(VCO Current)
  tmp = A7139_ReadPageA(device, VCB_PAGEA);
  vcb = tmp & 0x0F;
  vccf = (tmp>>4) & 0x01;
  if(vccf)
  {
    
  }
  
  
  //RSSI Calibration procedure @STB state
  A7139_WriteRegister(device, ADC_REG, 0x4C00);									//set ADC average=64
  A7139_WriteRegister(device, MODE_REG, A7139Config[MODE_REG] | 0x1000);			//RSSI Calibration
  do{
    tmp = A7139_ReadRegister(device, MODE_REG);
  }while(tmp & 0x1000);
  A7139_WriteRegister(device, ADC_REG, A7139Config[ADC_REG]);
  
  
  //VCO calibration procedure @STB state
  A7139_WriteRegister(device, PLL1_REG, A7139Config[PLL1_REG]);
  A7139_WriteRegister(device, PLL2_REG, A7139Config[PLL2_REG]);
  A7139_WriteRegister(device, MODE_REG, A7139Config[MODE_REG] | 0x0004);		//VCO Band Calibration
  do{
    tmp = A7139_ReadRegister(device, MODE_REG);
  }while(tmp & 0x0004);
  
  //for check(VCO Band)
  tmp = A7139_ReadRegister(device, CALIBRATION_REG);
  vb = (tmp >>5) & 0x07;
  vbcf = (tmp >>8) & 0x01;
  if(vbcf)
  {
    
  }
}


static void _A7139_Calibration(struct A7139_Device *device, uint16_t pll2)
{
  volatile uint8_t fb, fcd, fbcf;	//IF Filter
  volatile uint8_t vb,vbcf;              //VCO Current
  volatile uint8_t vcb, vccf;		//VCO Band
  uint16_t tmp;
  
  //IF calibration procedure @STB state
  A7139_WriteRegister(device, MODE_REG, A7139Config[MODE_REG] | 0x0802);			//IF Filter & VCO Current Calibration
  do
  {
    tmp = A7139_ReadRegister(device, MODE_REG);
  }while(tmp & 0x0802);
  
  //for check(IF Filter)
  tmp = A7139_ReadRegister(device, CALIBRATION_REG);
  fb = tmp & 0x0F;
  fcd = (tmp>>11) & 0x1F;
  fbcf = (tmp>>4) & 0x01;
  if (fbcf)
  {
    
  }
  
  //for check(VCO Current)
  tmp = A7139_ReadPageA(device, VCB_PAGEA);
  vcb = tmp & 0x0F;
  vccf = (tmp>>4) & 0x01;
  if(vccf)
  {
    
  }
  
  
  //RSSI Calibration procedure @STB state
  A7139_WriteRegister(device, ADC_REG, 0x4C00);									//set ADC average=64
  A7139_WriteRegister(device, MODE_REG, A7139Config[MODE_REG] | 0x1000);			//RSSI Calibration
  do{
    tmp = A7139_ReadRegister(device, MODE_REG);
  }while(tmp & 0x1000);
  A7139_WriteRegister(device, ADC_REG, A7139Config[ADC_REG]);
  
  
  //VCO calibration procedure @STB state
  A7139_WriteRegister(device, PLL1_REG, A7139Config[PLL1_REG]);
  A7139_WriteRegister(device, PLL2_REG, pll2);
  A7139_WriteRegister(device, MODE_REG, A7139Config[MODE_REG] | 0x0004);		//VCO Band Calibration
  do{
    tmp = A7139_ReadRegister(device, MODE_REG);
  }while(tmp & 0x0004);
  
  //for check(VCO Band)
  tmp = A7139_ReadRegister(device, CALIBRATION_REG);
  vb = (tmp >>5) & 0x07;
  vbcf = (tmp >>8) & 0x01;
  if(vbcf)
  {
    
  }
}

static void A7139_WriteFIFO(struct A7139_Device *device, uint8_t *data, uint8_t length)
{
  uint8_t i, max;
  struct virtual_spi_device *spi_device;
  
  
  if ( (device != NULL) && (data != NULL) && (length != 0) )
  {
    spi_device = device->spi_device;
    
    A7139_WriteCommand(device, CMD_TFR);		//TX FIFO address pointer reset
    
    spi_device_select(spi_device);
    
    spi_send_recv(spi_device, CMD_FIFO_W); //TX FIFO write command
    
    max = length <= 64 ? length : 64;
    
    for(i = 0; i < max; i++)
      spi_send_recv(spi_device, data[i]);
    
    spi_device_deselect(spi_device);
  }
}

static uint8_t A7139_ReadFIFO(struct A7139_Device *device, uint8_t *data, uint8_t size)
{
  uint8_t i, max;
  struct virtual_spi_device *spi_device;
  
  
  if ( (device != NULL) && (data != NULL) && (size != 0) )
  {
    spi_device = device->spi_device;
    
    A7139_WriteCommand(device, CMD_RFR);		//TX FIFO address pointer reset
    
    spi_device_select(spi_device);
    
    spi_send_recv(spi_device, CMD_FIFO_R); //TX FIFO write command
    
    max = size <= 64 ? size : 64;
    
    for(i = 0; i < max; i++)
      data[i] =  spi_send_recv(spi_device, 0 );
    
    spi_device_deselect(spi_device);
  }
  
  return max;
}

int HalRFRxFlag = 0;
int HalRFTxFlag = 1;

static void A7139_InterruptHandler(struct A7139_Device *device)
{
  uint16_t regTmp;
  
  
  switch (device->state)
  {
  case Init:
    A7139_StartRSSIMeasurement(device);    
    device->state = Receiving;
    A7139_WriteCommand(device, CMD_RX); 
    break;
    
  case Standby:
    break;
    
  case Sending:
    device->state = SendDone;
    A7139_StartRSSIMeasurement(device);
    device->state = Receiving;
    A7139_WriteCommand(device, CMD_RX);   
    HalRFTxFlag = 1;
    break;
    
  case Receiving:
    A7139_ReadFIFO(device, device->rx_buff, sizeof(device->rx_buff));
    device->state = ReceiveDone;    
    /* 读取RSSI */
    do
    {
      regTmp = A7139_ReadRegister(device, MODE_REG);
    }while ( (regTmp & (1 << 0)) );
    
    device->rssi = A7139_ReadRegister(device, RX2_REG) & 0x1FF;
    
    A7139_StartRSSIMeasurement(device);
    device->state = Receiving;
    A7139_WriteCommand(device, CMD_RX);
    HalRFRxFlag = 1;
    break;
  }
}

static void A7139_StartRSSIMeasurement(struct A7139_Device *device)
{
  device->state = Standby;
  A7139_WriteCommand(device, CMD_STBY);
  
  /* Set bit CDM=0 in ADC register */
  A7139_WriteRegister(device, ADC_REG, A7139Config[ADC_REG] | 0x8000);
  A7139_ReadRegister(device, MODE_REG);
  /* Set bit ADCM=1 in mode control register to start the RSSI measurement */
  A7139_WriteRegister(device, MODE_REG, A7139Config[MODE_REG] | 0x0001);
}

#if (defined HAL_RF_1)
HAL_RF1_INTERRUPT_HANDLER()
{
  EXTI_ClearITPendingBit(A7139_1_EXTI_IT_PIN);
  
  A7139_InterruptHandler(&A7139_DeviceList[0]);
}
#endif

#if (defined HAL_RF_2)
INTERRUPT_HANDLER(EXTI3_IRQHandler, 11)
{
  EXTI_ClearITPendingBit(EXTI_IT_Pin3);
  A7139_InterruptHandler(&A7139_DeviceList[1]);
}
#endif